In [29]:
import pandas as pd
import ast

In [2]:
pd.set_option("display.max_columns", None)
play_purchased_games=pd.read_csv("src/game/playstation/purchased_games.csv")
play_purchased_games.head()

   playerid                                            library
0    268071  [14972, 417905, 14693, 7742, 20162, 461983, 12...
1   2218485  [410618, 17456, 16034, 138931, 175202, 331007,...
2    253885  [417808, 706747, 619583, 492711, 555631, 18167...
3   1911732  [670209, 694794, 658551, 582894, 602666, 65531...
4   3098524  [19362, 170350, 12653, 20230, 12750, 18141, 41...

In [4]:
pd.set_option("display.max_columns", None)
steam_purchased_games=pd.read_csv("src/game/steam/purchased_games.csv")
steam_purchased_games.head()

            playerid                                            library
0  76561198060698936  [60, 1670, 3830, 1600, 2900, 2910, 2920, 4800,...
1  76561198287452552  [10, 80, 100, 240, 2990, 6880, 6910, 6920, 698...
2  76561198040436563  [10, 80, 100, 300, 20, 30, 40, 50, 60, 70, 130...
3  76561198042412488  [300, 240, 220, 320, 360, 4300, 4800, 4000, 61...
4  76561198119605821  [47870, 108600, 550, 271590, 331470, 381210, 2...

In [5]:
pd.set_option("display.max_columns", None)
xbox_purchased_games=pd.read_csv("src/game/xbox/purchased_games.csv")
xbox_purchased_games.head()

   playerid                                            library
0    848738  [14711, 2128, 10783, 9118, 7235, 9637, 717236,...
1    848736  [707376, 747223, 550303, 620354, 734202, 74678...
2   1470783  [638932, 32551, 748147, 468697, 446682, 615753...
3    848735  [736287, 555825, 717258, 422060, 12645, 550263...
4    848739  [698325, 443814, 745210, 747223, 734202, 71154...

In [6]:
# ajouter une colonne plateforme pour playstation

play_purchased_games["plateforme"]="playstation"
play_purchased_games.head()

   playerid                                            library   plateforme
0    268071  [14972, 417905, 14693, 7742, 20162, 461983, 12...  playstation
1   2218485  [410618, 17456, 16034, 138931, 175202, 331007,...  playstation
2    253885  [417808, 706747, 619583, 492711, 555631, 18167...  playstation
3   1911732  [670209, 694794, 658551, 582894, 602666, 65531...  playstation
4   3098524  [19362, 170350, 12653, 20230, 12750, 18141, 41...  playstation

In [7]:
# ajouter une colonne plateforme pour steam

steam_purchased_games["plateforme"]="steam"
steam_purchased_games.head()

,playerid,library,plateforme
0,76561198060698936,"[60, 1670, 3830, 1600, 2900, 2910, 2920, 4800,...",steam
1,76561198287452552,"[10, 80, 100, 240, 2990, 6880, 6910, 6920, 698...",steam
2,76561198040436563,"[10, 80, 100, 300, 20, 30, 40, 50, 60, 70, 130...",steam
3,76561198042412488,"[300, 240, 220, 320, 360, 4300, 4800, 4000, 61...",steam
4,76561198119605821,"[47870, 108600, 550, 271590, 331470, 381210, 2...",steam

In [8]:
# ajouter une colonne plateforme pour xbox

xbox_purchased_games["plateforme"]="xbox"
xbox_purchased_games.head()

   playerid                                            library plateforme
0    848738  [14711, 2128, 10783, 9118, 7235, 9637, 717236,...       xbox
1    848736  [707376, 747223, 550303, 620354, 734202, 74678...       xbox
2   1470783  [638932, 32551, 748147, 468697, 446682, 615753...       xbox
3    848735  [736287, 555825, 717258, 422060, 12645, 550263...       xbox
4    848739  [698325, 443814, 745210, 747223, 734202, 71154...       xbox

In [9]:
# concatenation et avec ignore rajouter index en suivant bon ordre

purchased_games=pd.concat([play_purchased_games,steam_purchased_games,xbox_purchased_games], ignore_index=True)

In [10]:
purchased_games.head()

   playerid                                            library   plateforme
0    268071  [14972, 417905, 14693, 7742, 20162, 461983, 12...  playstation
1   2218485  [410618, 17456, 16034, 138931, 175202, 331007,...  playstation
2    253885  [417808, 706747, 619583, 492711, 555631, 18167...  playstation
3   1911732  [670209, 694794, 658551, 582894, 602666, 65531...  playstation
4   3098524  [19362, 170350, 12653, 20230, 12750, 18141, 41...  playstation

In [13]:
# creer le fichier concatené source

purchased_games.to_csv("out/purchased_games_source.csv")

In [17]:
purchased_games.shape

(195596, 4)

In [14]:
# ajouter une colonne count avec lambdas
# rappel lambdas: pour chaque valeur de x met 0 s'il n'y a rien, sinon tu fais le nombre d'éléments dans la liste


purchased_games["count"]=purchased_games["library"].apply (
                                        lambda x:                                         
                                          0 if pd.isnull(x)
                                          else len(x)                                         
                                          
)

purchased_games.head()

,playerid,library,plateforme,count
0,268071,"[14972, 417905, 14693, 7742, 20162, 461983, 12...",playstation,1701
1,2218485,"[410618, 17456, 16034, 138931, 175202, 331007,...",playstation,6299
2,253885,"[417808, 706747, 619583, 492711, 555631, 18167...",playstation,299
3,1911732,"[670209, 694794, 658551, 582894, 602666, 65531...",playstation,968
4,3098524,"[19362, 170350, 12653, 20230, 12750, 18141, 41...",playstation,1223

In [15]:
# enregistrer le nouveau fichier

purchased_games.to_csv("out/purchased_games_count.csv")

Créer dataframe avec explode pour faciliter les merges et faire des statistiques sur le lien entre les joueurs et les jeux

In [34]:

purchased_games=pd.read_csv("out/purchased_games_source.csv",index_col=0)

In [35]:
purchased_games.head()

   playerid                                            library   plateforme
0    268071  [14972, 417905, 14693, 7742, 20162, 461983, 12...  playstation
1   2218485  [410618, 17456, 16034, 138931, 175202, 331007,...  playstation
2    253885  [417808, 706747, 619583, 492711, 555631, 18167...  playstation
3   1911732  [670209, 694794, 658551, 582894, 602666, 65531...  playstation
4   3098524  [19362, 170350, 12653, 20230, 12750, 18141, 41...  playstation

In [36]:
# regarder type de premiere ligne de la colonne library

type(purchased_games['library'].iloc[0])

str

In [37]:
# calculer le nombre des valeurs manquantes 

purchased_games.isnull().sum()

playerid          0
library       55607
plateforme        0
dtype: int64

In [38]:
# mettre les valeurs manquantes en liste pour garder les joueurs sans jeu pour sortir le nombre de joueurs actif par plateforme


purchased_games["library"]=purchased_games["library"].apply (
                                        lambda x:                                         
                                          "[]" if pd.isnull(x)
                                          else x                                       
                                          
)

purchased_games.head()

   playerid                                            library   plateforme
0    268071  [14972, 417905, 14693, 7742, 20162, 461983, 12...  playstation
1   2218485  [410618, 17456, 16034, 138931, 175202, 331007,...  playstation
2    253885  [417808, 706747, 619583, 492711, 555631, 18167...  playstation
3   1911732  [670209, 694794, 658551, 582894, 602666, 65531...  playstation
4   3098524  [19362, 170350, 12653, 20230, 12750, 18141, 41...  playstation

In [39]:
# vérifier le nombre des valeurs manquantes 

purchased_games.isnull().sum()

playerid      0
library       0
plateforme    0
dtype: int64

In [40]:
# mettre tout en type liste pour pouvoir faire explode après

purchased_games['library'] = purchased_games['library'].apply(ast.literal_eval)

In [41]:
# split (avec explode) pour transformer la liste des valeurs en autant de lignes qu'il y a d'élément dans la liste 
# pour deux buts: 
# 1) nb de jeux par joueur (avec groupby et sum)
# 2) nb de joueurs par jeu (avec groupby et sum)

purchased_games_splitlibrary = purchased_games.explode('library')

In [42]:
purchased_games_splitlibrary

        playerid library   plateforme
0         268071   14972  playstation
0         268071  417905  playstation
0         268071   14693  playstation
0         268071    7742  playstation
0         268071   20162  playstation
...          ...     ...          ...
195595   4017053    2526         xbox
195595   4017053    6889         xbox
195595   4017053    1128         xbox
195595   4017053    1155         xbox
195595   4017053    1141         xbox

[34875751 rows x 3 columns]

In [47]:
# le nombre de joueurs n'ayant aucun jeu

purchased_games_splitlibrary.isnull().sum()

playerid          0
gameid        55607
plateforme        0
dtype: int64

In [45]:
# renommer la colonne library en gameid

purchased_games_splitlibrary.columns =["playerid", "gameid", "plateforme"]

purchased_games_splitlibrary.head()

   playerid  gameid   plateforme
0    268071   14972  playstation
0    268071  417905  playstation
0    268071   14693  playstation
0    268071    7742  playstation
0    268071   20162  playstation

In [46]:
purchased_games_splitlibrary.to_csv("out/purchased_games_final.csv",index=False)